package com.startainstitute.summary_2306;

import java.time.LocalDate;
import java.time.ZoneId;

public class CodingProblems {

    // 1. Дан массив целых чисел. Нужно найти наибольшую разницу между двумя элементами массива
    // 2. Дан двумерный массив из N строк. Нужно найти для каждой строки сумму всех значений колонок
    // и сохранить в массиве размера N.
    // 3. Очередь. Добавить N элементов из целых чисел. Удалить отрицальные элементы из начала очереди и вывести
    // их на экран.

    // 4. [1,2,2,3,4,3,7]. Найти все повторы в массиве, но вывести на экран только те, которые повторяются 3 и более раз.
    // Числа целые.

    // ** Дан произвольный массив целых чисел. Нужно найти элемент (л, который больше чем элемент справа и слева.
    // Кроме этого важно,

    // 00000111111
    // 01111111111
    // 00111111111
    // 0000111111


    public static void main(String[] args) {
        LocalDate.parse("2023-06-01").atStartOfDay(ZoneId.of("Europe/Berlin"));
//        if (2 > 3) System.out.println("Yes");
//        else System.out.println("No");
    }
}
